# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple
anchors: 3

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 7, 2, 3]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4

   [-1, 6, DenseBlock, [256,64,32,0.1]],
   [-1, 1, TransitionLayer, [128, 128]],  # 3-P3/8

   [-1, 12, DenseBlock, [512,128,32,0.2]],
   [-1, 1, TransitionLayer, [256, 256]],  # 5-P4/16

   [-1, 24, DenseBlock, [1024,256,32,0.2]],
   [-1, 1, TransitionLayer, [512, 512]],  # 7-P5/32

   [-1, 16, DenseBlock, [1024,512,32,0.2]],
   [-1, 1, SPPF, [1024, 5]],  # 9
   ] # 3-P3/8


# YOLOv5 v6.0 FPN head
head:
 [[-1, 3, C3, [1024, False]],  # 10 (P5/32-large)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [[-1, 6], 1, Concat, [1]],  # cat backbone P4
  [-1, 1, Conv, [512, 1, 1]],

  [-1, 3, C3, [512, False]],  # 14 (P4/16-medium)
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [[-1, 4], 1, Concat, [1]],  # cat backbone P3
  [-1, 1, Conv, [256, 1, 1]],

  [-1, 3, C3, [256, False]],  # 18 (P3/8-small)
  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  [[-1, 2], 1, Concat, [1]],  
  [-1, 1, Conv, [128, 1, 1]],

  [-1, 3, C3, [128, False]],  # 22
  
  [[14,18, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  
  ]